//? 1. What is the difference between setTimeout and setInterval ?
//!  Answer:

// setTimeout : 👇
// فرض میکنیم که به این متود عدد 5000 میلی ثانیه رو میدیم
//  مهدی" رو داخلش لاگ میگیریم"
// و این متود میاد بعد از 5 ثانیه "مهدی" رو بهمون نمایش میده
// در واقع نکته مهم اینه که یک بار با تاخیر اون دستور ما رو انجام میده



// setInterval : 👇
// فرض میکنیم که به این متود عدد 5000 میلی ثانیه رو میدیم
//  مهدی" رو داخلش لاگ میگیریم"
// این متود هر 5 ثانیه یک بار , "مهدی" رو بهمون نمایش میده
// و به طور مستمر این لاگ ادامه دارد 
// در واقع نکتع مهم این متود اینه که 
// هر چند ثانیه یکبار میاد و کد ما رو اجرا میکنه